# TextTypeId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalysisDisplayLegendSettings..::..TextTypeId Property
AnalysisDisplayLegendSettings Class See Also
---
Element id of text associated with legend body.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public ElementId TextTypeId { get; set; }
```

Visual Basic
---
```text
Public Property TextTypeId As ElementId
	Get
	Set
```

Visual C++
---
```text
public:
property ElementId^ TextTypeId {
	ElementId^ get ();
	void set (ElementId^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
AnalysisDisplayLegendSettings Class
Autodesk.Revit.DB.Analysis Namespace